app/views/stories/show.html.erb

SELECT "characters".* FROM "characters" INNER JOIN "characters_stories" ON "characters"."id" = "characters_stories"."character_id" WHERE "characters_stories"."story_id" = $1  [["story_id", 1]]
---
  <strong>Characters:</strong>
  <% @story.character.each do |character| %>