app/views/characters/show.html.erb

	  <h1><strong>Stories</strong></h1>
	  <% @character.story.each do |story| %>
---
SELECT "stories".* FROM "stories" INNER JOIN "characters_stories" ON "stories"."id" = "characters_stories"."story_id" WHERE "characters_stories"."character_id" = $1  [["character_id", 1]]