app/views/universes/show.html.erb

	<strong>List of stories:</strong>
	<% @universe.story.each do |story| %>
---
SELECT "stories".* FROM "stories" WHERE "stories"."universe_id" = $1  [["universe_id", 2]]