app/controllers/characters_controller.rb

SELECT "stories".* FROM "stories"
SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @stories = Story.all
    @character = Character.find(params[:id])

INSERT INTO "characters" ("name", "qualities", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Harry Powers"], ["qualities", "{\"Hair\": \"Red\"}"], ["user_id", 1], ["created_at", "2019-12-02 06:39:18.253374"], ["updated_at", "2019-12-02 06:39:18.253374"]]
---
  def create
    @character = Character.new(character_params.merge(user_id: current_user.id, qualities: '{}'))

    respond_to do |format|
      if @character.save

SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "characters" SET "name" = $1, "updated_at" = $2 WHERE "characters"."id" = $3  [["name", "Amanda Kirbyss"], ["updated_at", "2019-11-28 14:10:33.385816"], ["id", 2]]
---
  def update
    # render plain: character_params
    @character = Character.find(params[:id])
    @character.update(character_params)

SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "characters" WHERE "characters"."id" = $1  [["id", 6]]
---
  def destroy
    @character = Character.find(params[:id])
    @character.destroy

SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def addRelation
    @character = Character.find(params[:id])

SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "relationships" ("character_id", "character2", "affiliation", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["character_id", 1], ["character2", 7], ["affiliation", "Friend"], ["created_at", "2019-12-02 06:41:17.879556"], ["updated_at", "2019-12-02 06:41:17.879556"]]
---
  def createRelation
    @character = Character.find(params[:id])
    @relation_params = relation_params.merge(character2: @character.id)
    @newRelation = Relationship.new(@relation_params)
    respond_to do |format|
      if @newRelation.save

SELECT "relationships".* FROM "relationships" WHERE "relationships"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "relationships" WHERE "relationships"."id" = $1  [["id", 6]]
---
  def destroyRelation
    @relationship = Relationship.find(params[:id])
    @relationship.destroy

SELECT "characters".* FROM "characters"
SELECT "relationships".* FROM "relationships"
SELECT "characters"."id", "characters"."name" FROM "characters"
---
  def d3json
    @characters = Character.all
    @relationships = Relationship.all
    @data = {}
    @data[:nodes] = @characters.select(:id,:name)