app/controllers/characters_controller.rb

SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def createRelation
    @character = Character.find(params[:id])