app/controllers/homes_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def index
    if user_signed_in?
      @user_id = current_user.id
      @name = User.where(id: @user_id)[0]