app/controllers/stories_controller.rb

SELECT "universes".* FROM "universes"
---
  def new
    # @story = Story.new
    @universes = Universe.all

SELECT "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "universes".* FROM "universes"
---
  def edit
    @story = Story.find(params[:id])
    @universes = Universe.all

INSERT INTO "stories" ("name", "universe_id", "genre", "summary", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Lol"], ["universe_id", 1], ["genre", "Horror"], ["summary", "Scary Lol"], ["user_id", 1], ["created_at", "2019-11-30 08:23:06.233991"], ["updated_at", "2019-11-30 08:23:06.233991"]]
---
  def create
    @story = Story.new(story_params.merge(user_id: current_user.id))

    @story.save

UPDATE "stories" SET "summary" = $1, "updated_at" = $2 WHERE "stories"."id" = $3  [["summary", "An alternative world where Coders conquered the world and everyone is enlisted to code"], ["updated_at", "2019-11-30 08:47:33.113892"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @story.update(story_params)