app/controllers/stories_controller.rb

SELECT "genres".* FROM "genres"
---
  def new
    # @story = Story.new
    @universes = Universe.where(user_id: current_user.id)
    @genres = Genre.all

SELECT "genres".* FROM "genres"
---
  def edit
    @story = Story.find(params[:id])
    @universes = Universe.where(user_id: current_user.id)
    @genres = Genre.all