app/controllers/universes_controller.rb

SELECT "universes".* FROM "universes"
---
  def index
    @universes = Universe.all

SELECT "universes".* FROM "universes" WHERE "universes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @universe = Universe.find(params[:id])

SELECT "universes".* FROM "universes" WHERE "universes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @universe = Universe.find(params[:id])

INSERT INTO "universes" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Techdevia"], ["description", "Sci-fi Universess"], ["user_id", 1], ["created_at", "2019-11-28 13:45:37.320800"], ["updated_at", "2019-11-28 13:45:37.320800"]]
---
  def create
    @universe = Universe.new(universe_params.merge(user_id: current_user.id))
    @universe.save

SELECT "universes".* FROM "universes" WHERE "universes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "universes" SET "description" = $1, "updated_at" = $2 WHERE "universes"."id" = $3  [["description", "Has magical property"], ["updated_at", "2019-11-28 13:53:44.774511"], ["id", 1]]
---
  def update
    @universe = Universe.find(params[:id])
    @universe.update(universe_params)

SELECT "universes".* FROM "universes" WHERE "universes"."id" = $1  [["id", 4]]
DELETE FROM "universes" WHERE "universes"."id" = $1  [["id", 4]]
---
  def destroy
    @universe = Universe.find(params[:id])
    @universe.destroy