app/models/character.rb

  def characterRelationship
    @relationship = Relationship.where('character_id = ? or character2 = ?', self.id, self.id)

    relationHash = {}

    @relationship.each do |relation|
      @character = Character.where(id: relation.character_id)[0]

      charName = @character.name.to_s
      if charName == self.name
        @character = Character.where(id: relation.character2)[0]
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1  [["id", 1]]
SELECT "relationships".* FROM "relationships" WHERE (character_id = 1 or character2 = 1)
SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1  [["id", 3]]
SELECT "relationships".* FROM "relationships" WHERE "relationships"."character2" = $1  [["character2", 3]]
SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1  [["id", 2]]

  def notRelated
    @relationship = characterRelationship.keys
    @allCharacters = Character.where.not(id: self.id)
---
SELECT "characters".* FROM "characters"